//-------------------------------------------------------------------------------------------//
//-- Kim Somfleth <kim.somfleth@internode.on.net>                                          --//
//--                      SINGLE HEADER LIBARY                                             --//
//-------------------------------------------------------------------------------------------//

//-- HL META WISHLIST --//
//-- PRINT STRUCT     --//
//-- ENUM2MAP         --//
//-- ->next structs   --//
#if !defined( _HARMLESS_H )
#include <stdlib.h>

#if defined( _MSC_VER )
#include <windows.h>
#elif defined( __GNUC__ )
#include <dlfcn.h> //-- CHECKED TO BE CRT-LESS SAFE --//
#endif

#if !(defined( hlAVX512 ) || defined( hlAVX ) || defined( hlSSE ))
  #if defined( __AVX512__ )
    #define hlAVX512
    #define hlSIMD
  #elif defined( __AVX__ )
    #define hlAVX
    #define hlSIMD
  #endif
#endif
#if defined( __cplusplus )
  #define hlEXTERN extern "C" 
#else
  #define hlEXTERN extern
#endif

#define _STR( str ) #str
#define STR( str ) _STR( str )

#define hlUSEWITHCAUTION(_1,_2,name,...) name

#if defined( _MSC_VER )
hlEXTERN int _fltused = 0; //-- WTF C --//
#elif defined( __GNUC__ )
hlEXTERN int _fltused;     //-- WTF C --//
#endif


//-- THESE ARE CRT-LESS SAFE HEADER FILES --//
#include <stddef.h> //-- size_t                                 --//
#include <stdint.h> //-- int8_t -- int64_t, uint8_t -- u64_t --//
typedef int8_t   i8;
typedef int16_t  i16;
typedef int32_t  i32;
typedef int64_t  i64;
typedef uint8_t  u8;
typedef uint16_t u16;
typedef uint32_t u32;
typedef uint64_t u64;
typedef char     c8;
typedef u32      b32;
typedef float    r32;
typedef double   r64;
#include <stdarg.h> //-- va_arg, va_start, va_end, va_arg       --//
#if defined( _MSC_VER )
  #include <Intrin.h>      //-- ASSEMBLY INTRINSICS --//
#elif defined( __GNUC__ )
  r64 strtod( const c8 *str, c8 **end );
  long atol( const c8 *str );
  hlEXTERN r64 atof( const c8 *str );
  //#include <x86intrin.h>   //-- ASSEMBLY INTRINSICS --//
#endif

#define hlARRAYCOUNT( array ) ( sizeof( array ) / sizeof( (array)[ 0 ] ) )

//-------------------------------------------------------------------------------------------//
//--                                     ASSERTS                                           --//
//-------------------------------------------------------------------------------------------//

#if defined( hlDEBUG )
  #define __hlSTATIC_ASSERT3( expr, msg ) typedef char static_assertion_##msg[(!!( expr ) ) * 2 - 1]
  #define __hlSTATIC_ASSERT2( expr, ln ) __hlSTATIC_ASSERT3( expr, cc_assert_line_##ln )
  #define __hlSTATIC_ASSERT1( expr, ln ) __hlSTATIC_ASSERT2( expr, ln )
  #define hlSTATIC_ASSERT( expression )  __hlSTATIC_ASSERT1( expression, __LINE__ )
#if defined( _MSC_VER )
  #define hlWRITE_DEBUG_STR( str ) ( OutputDebugStringA( str ) )
  #define hlASSERT( expression ) if( !(expression ) ){ *(i32 *)0 = 0; }
#elif defined( __GNUC__ )
#if defined( __cplusplus ) 
#include <stdio.h> //--TODO--//
  #define hlWRITE_DEBUG_STR( str )( { char write_str[] = str; printf( "%s", write_str ); } )
  #define hlDEBUG_STR( str ) hlWRITE_DEBUG_STR( "[DEBUG] " str )
  #define hlERROR_STR( str ) hlWRITE_DEBUG_STR( "[ERROR] " str )
#else
  u64 write( i32 dest, void *buffer, u64 buffer_size ); //-- INCLUDES UNISTR --//
  #define hlWRITE_DEBUG_STR( str ) ( { char write_str[] = str; write( 1, write_str, sizeof( write_str ) ); } )
  #define hlDEBUG_STR( str ) hlWRITE_DEBUG_STR( "[DEBUG] " str )
  #define hlERROR_STR( str ) hlWRITE_DEBUG_STR( "[ERROR] " str )
#endif
  #define _hlASSERTION_STRING2( file, line ) "ASSERTION FAILED! " file ":" #line "\n"
  #define _hlASSERTION_STRING1( file, line ) _hlASSERTION_STRING2( file, line ) 
  #define ASSERTION_STRING _hlASSERTION_STRING1( __FILE__, __LINE__ )

  #define hlASSERT( expression ) if( !(expression) ){ hlERROR_STR( ASSERTION_STRING ); *(volatile i32 *)0 = 0; }
#endif

#else
  #define hlDEBUG_STR( str )
  #define hlERROR_STR( str )
  #define hlSTATIC_ASSERT( expression )
  #define hlASSERT( expression )
#endif

#define hlCOUNTER_DEBUG (hlDEBUG_STR( "COUNTER" STR( __COUNTER__ ) "\n" ))

hlSTATIC_ASSERT( sizeof( u32    ) == 4 );
hlSTATIC_ASSERT( sizeof( u64    ) == 8 );
hlSTATIC_ASSERT( sizeof( i32    ) == 4 );
hlSTATIC_ASSERT( sizeof( i64    ) == 8 );
hlSTATIC_ASSERT( sizeof( size_t ) == 8 );
hlSTATIC_ASSERT( sizeof( r32    ) == 4 );
hlSTATIC_ASSERT( sizeof( r64    ) == 8 );
hlSTATIC_ASSERT( sizeof( void * ) == 8 );
hlSTATIC_ASSERT( sizeof( c8     ) == 1 );

#if !(defined( __x86_64__ ) || defined( _M_AMD64 ))
#error REQUIRE 64 BIT OS
#endif

#define R64_DIGIT_PRECISION 15                      //-- NUMBER OF DIGITS IN PRECISION --//
#define R64_DIGIT_MANTISSA  53                      //-- NUMBER OF DIGITS IN MANTISSA  --//
#define R64_EPSILON         2.2204460492503131E-16  //-- 1.0 + REAL64_EPSILON != 1.0   --//
#define R64_MIN             2.2250738585072014E-308 //-- MINIMUM REAL64                --//
#define R64_MAX             1.7976931348623157E+308 //-- MAXIMUM REAL64                --//

#define R32_LARGEST_ODD     16777215                //-- POINT AT WHICH (u)int32 MORE PRECISE THAN real32 --//
#define R32_DIGIT_PRECISION 6                       //-- NUMBER OF DIGITS IN PRECISION                    --//
#define R32_DIGIT_MANTISSA  24                      //-- NUMBER OF DIGITS IN MANTISSA                     --//
